#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/confd

# Completions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# Completion styles
#belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

# Keybindings
belak/zsh-utils path:editor

# History
belak/zsh-utils path:history

# Prompt
romkatv/powerlevel10k

#getantidote/use-omz
#ohmyzsh/ohmyzsh path:plugins/extract

aloxaf/fzf-tab  # Remove if you don't use fzf

# Other Fish-like features
zdharma-continuum/fast-syntax-highlighting kind:defer  # Syntax highlighting
zsh-users/zsh-autosuggestions kind:defer               # Auto-suggestions
zsh-users/zsh-history-substring-search kind:defer      # Up/Down to search history
ohmyzsh/ohmyzsh path:plugins/colored-man-pages kind:defer